experiments/results/minperf_kda_s96_20260822/arm_kda_ragged_N40_S96.log
[launch] backend=kda mode=ragged N=40 distinct=184 ckpt=267 wmax=16 ragged=1 reqs=184 -> /home/hadoop-scale-llm/VSCodeProjects/sglang/repro_results/minperf_kda_s96_20260822/server_kda_ragged_N40_w16_ckpt267_recon0.log
[wait] server pid=4055296 warming up...
[ready] after 80s
[capacity] backend=kda mode=ragged cap=2.79x bytes/slot=7523584 slots=267 ckpt_HBM=1915.7MB (avg of 2 TP ranks) ([2026-08-22 12:53:29 TP1] head-aware mamba checkpoint pool (route A): plan built, bytes/slot=7476224 vs dense 20971520 (2.81x capacity); 2.05GB over 267 slots)
[flush]
[warm] backend=kda mode=ragged
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31007, ready_check_timeout_sec=60, dataset_name='custom', dataset_path='/tmp/arena_shared_prefix_N40.jsonl', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/home/hadoop-scale-llm/VSCodeProjects/sglang/Kimi-Linear-48B-A3B-Instruct', served_model_name=None, tokenizer=None, num_prompts=184, sharegpt_output_len=64, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=16, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, gsp_len_pop_corr=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:31007/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31007, ready_check_timeout_sec=60, dataset_name='custom', dataset_path='/tmp/arena_shared_prefix_N40.jsonl', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/home/hadoop-scale-llm/VSCodeProjects/sglang/Kimi-Linear-48B-A3B-Instruct', served_model_name=None, tokenizer=None, num_prompts=184, sharegpt_output_len=64, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=16, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, gsp_len_pop_corr=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 234443
#Output tokens: 11776
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 184/184 [00:12<00:00, 14.53it/s]
Calling super().encode with {'add_special_tokens': False}
Calling super().encode with {'add_special_tokens': False}
Calling super().encode with {'add_special_tokens': False}
[...]

============ Serving Benchmark Result ============
Backend:                                 sglang
Traffic request rate:                    inf
Max request concurrency:                 16
Successful requests:                     184
Benchmark duration (s):                  12.67
Total input tokens:                      234443
Total input text tokens:                 234443
Total generated tokens:                  11776
Total generated tokens (retokenized):    11295
Request throughput (req/s):              14.52
Input token throughput (tok/s):          18501.05
Output token throughput (tok/s):         929.30
Peak output token throughput (tok/s):    1136.00
Peak concurrent requests:                32
Total token throughput (tok/s):          19430.35
Concurrency:                             15.55
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   1071.10
Median E2E Latency (ms):                 1038.07
P90 E2E Latency (ms):                    1298.98
P95 E2E Latency (ms):                    1384.78
P99 E2E Latency (ms):                    1386.07
---------------Time to First Token----------------
Mean TTFT (ms):                          321.77
Median TTFT (ms):                        283.94
P90 TTFT (ms):                           539.89
P95 TTFT (ms):                           631.40
P99 TTFT (ms):                           812.72
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          11.89
Median TPOT (ms):                        11.91
P90 TPOT (ms):                           15.23
P95 TPOT (ms):                           16.20
P99 TPOT (ms):                           19.00
---------------Inter-Token Latency----------------
Mean ITL (ms):                           11.89
Median ITL (ms):                         8.18
P90 ITL (ms):                            8.48
P95 ITL (ms):                            8.71
P99 ITL (ms):                            109.83
Max ITL (ms):                            741.28
==================================================
[measure] backend=kda mode=ragged seed=42
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31007, ready_check_timeout_sec=60, dataset_name='custom', dataset_path='/tmp/arena_shared_prefix_N40.jsonl', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/home/hadoop-scale-llm/VSCodeProjects/sglang/Kimi-Linear-48B-A3B-Instruct', served_model_name=None, tokenizer=None, num_prompts=184, sharegpt_output_len=64, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=16, output_file='/home/hadoop-scale-llm/VSCodeProjects/sglang/repro_results/minperf_kda_s96_20260822/result_kda_ragged_N40_w16_ckpt267_recon0_seed42.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, gsp_len_pop_corr=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:31007/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31007, ready_check_timeout_sec=60, dataset_name='custom', dataset_path='/tmp/arena_shared_prefix_N40.jsonl', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/home/hadoop-scale-llm/VSCodeProjects/sglang/Kimi-Linear-48B-A3B-Instruct', served_model_name=None, tokenizer=None, num_prompts=184, sharegpt_output_len=64, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=16, output_file='/home/hadoop-scale-llm/VSCodeProjects/sglang/repro_results/minperf_kda_s96_20260822/result_kda_ragged_N40_w16_ckpt267_recon0_seed42.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, gsp_len_pop_corr=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 234443
#Output tokens: 11776
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 184/184 [00:08<00:00, 20.61it/s]
Calling super().encode with {'add_special_tokens': False}
Calling super().encode with {'add_special_tokens': False}
Calling super().encode with {'add_special_tokens': False}
[...]

============ Serving Benchmark Result ============
Backend:                                 sglang
Traffic request rate:                    inf
Max request concurrency:                 16
Successful requests:                     184
Benchmark duration (s):                  8.94
Total input tokens:                      234443
Total input text tokens:                 234443
Total generated tokens:                  11776
Total generated tokens (retokenized):    11338
Request throughput (req/s):              20.58
Input token throughput (tok/s):          26226.30
Output token throughput (tok/s):         1317.34
Peak output token throughput (tok/s):    1584.00
Peak concurrent requests:                48
Total token throughput (tok/s):          27543.64
Concurrency:                             15.33
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   744.81
Median E2E Latency (ms):                 724.03
P90 E2E Latency (ms):                    748.62
P95 E2E Latency (ms):                    1082.81
P99 E2E Latency (ms):                    1083.90
---------------Time to First Token----------------
Mean TTFT (ms):                          181.11
Median TTFT (ms):                        152.43
P90 TTFT (ms):                           173.46
P95 TTFT (ms):                           525.73
P99 TTFT (ms):                           526.83
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          8.95
Median TPOT (ms):                        8.99
P90 TPOT (ms):                           9.19
P95 TPOT (ms):                           10.07
P99 TPOT (ms):                           10.39
---------------Inter-Token Latency----------------
Mean ITL (ms):                           8.95
Median ITL (ms):                         8.09
P90 ITL (ms):                            8.44
P95 ITL (ms):                            8.62
P99 ITL (ms):                            63.48
Max ITL (ms):                            104.70
==================================================
[hit] backend=kda mode=ragged seed=42 cached=227698 new=7772 token_hit_rate=0.9670
[result] kda/ragged N40 seed=42: hit=0.9670 ttft_mean=181.1 p50=152.4 p95=525.7 p99=526.8 thr=1317.3 e2e=744.8 in_tok=234443 ckpt=267 HBM=1915.7MB cap=2.79x peak=NA recon_hits=NA replay_mean=NA
[done] backend=kda mode=ragged (seeds=42) -> /home/hadoop-scale-llm/VSCodeProjects/sglang/repro_results/minperf_kda_s96_20260822/result_kda_ragged_N40_w16_ckpt267_recon0_seed*.json